server/taurus.yml
execution:
- executor: siege
  concurrency: 100
  hold-for: 20s
  scenario: external_urls

reporting:
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  failed-labels: true  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-csv: 'results.csv'
  dump-xml: 'results.xml'

scenarios:
  external_urls:
    think-time: 15s
    requests:
    - 'https://www.qa.rent.com/georgia/atlanta-apartments'